pages/writings.org

#+SETUPFILE: ../res/mathsetup.org

#+BEGIN_EXPORT html
\(
\newcommand{\re}{\mathop{\rm Re}\nolimits}
\newcommand{\im}{\mathop{\rm Im}\nolimits}
\newcommand{\coker}{\mathop{\rm coker}\nolimits}
\newcommand{\supp}{\mathop{\rm supp}\nolimits}
\newcommand{\ord}{\mathop{\rm ord}\nolimits}
\newcommand{\Spec}{\mathop{\rm Spec}\nolimits}
\newcommand{\vol}{\mathop{\rm vol}\nolimits}
\newcommand\restr[2]{{\left.#1\right|_{#2}}}
\newcommand{\transp}{\mathop{\rm \,^t}\nolimits}
\newcommand{\sff}{\mathop{\rm I\!I}\nolimits}
\newcommand{\tr}{\mathop{\rm Tr}\nolimits}
\newcommand{\const}{\mathop{\rm const }\nolimits}
\newcommand{\lcm}{\mathop{\rm lcm}\nolimits}
\newcommand{\gcd}{\mathop{\rm gcd}\nolimits}
\newcommand{\Ric}{\mathop{\rm Ric}\nolimits}
\newcommand{\Riem}{\mathop{\rm Riem}\nolimits}
\newcommand{\Enorm}{\mathop{\mathcal{E}_{\rm norm}}\nolimits}
\newcommand{\Anorm}{\mathop{\mathcal{A}_{\rm norm}}\nolimits}
\)
#+END_EXPORT


* Variation of renormalised quantities <2018-11-26 Mon>   :noexport:

Although we had a formula for the different \( \Enorm- 2\Anorm \)
\[
 \Enorm-2\Anorm = \frac{1}{4}\int_\Sigma \frac{|q(f,[h_0],g)|^2_{h}}{\tr_h f^*g + 2\sqrt{\det_h
f^* g}}dV_h
\]
it is not straightforward to differentiate this formula to find \( \frac{d}{dt}\Enorm
(f_t) - \frac{d}{dt}2\Anorm (f_t(\Sigma)) \).

#+ATTR_LATEX: :options [Variation of renormalised quantities]
#+ATTR_HTML: :id prop:var-var :btit (Variation of renormalised quantities) 
#+BEGIN_proposition
#+LATEX: \label{prop:var-var}
One has
\begin{equation}
\label{eq:var-var}
\frac{d}{dt}\Enorm(f_t,h_0,g) - \frac{d}{dt}2\Anorm(f_t(\Sigma)) = \frac{1}{4}\int_\Sigma
\langle \re q(f_0,[h_0],g), \frac{dh_t}{dt} \rangle_{h_0} dV_{h_0}
\end{equation}
In particular, at harmonic map \( f_0 \) who satisfies stronger boundary condition (then \( h_0 \) is
conformal to \( f^*g \)), the two variation coincide.
#+END_proposition

We will start by distinguishing the two notion in classical context. Let \( \Sigma_t \) be a
family of surface in an ambiant space \( M \), then one way to look at them is as a family
of immersions from a model surface \( \Sigma \) to \( M \).
\[
f_t:\Sigma \longrightarrow M
\]
equip \( \Sigma \) with a metric \( h \), the energy functional of \( f_t \) is 
\[
 E(f_t,h, g) = \int_\Sigma \tr_h f_t^*g\ dV_h
\]
which generalises the area functional \( A(f_t,g) = \text{area}(f_t(\Sigma)) =
\frac{1}{2}E(f_t,f_t^* g,g) \).

However, by variation of energy, we mean
\(
 \frac{d}{dt}E(f_t,h,g)
\)
which is different from the variation of area \(
\frac{d}{dt}A(\Sigma_t)=\frac{1}{2}\frac{d}{dt}E(f_t,h_t,g)\) where \( h_t = f_t^*g \).

The two variations are related by the following formula:
\begin{equation}
\label{eq:var-var-1}
\frac{d}{dt}E(f_t,h_t,g) = \frac{d}{dt}E(f_t,h_0,g) + \frac{1}{4}\int_\Sigma \left\langle \re q(f_0,[h_0],g), \frac{d h_t}{dt} \right\rangle_{h_0}dV_{h_0}
\end{equation}
where \( q(f_0,[h_0],g) = \langle \frac{\partial f_0}{\partial z}, \frac{\partial
f_0}{\partial z} \rangle_g dz\otimes dz \) is the *quadratic differential* of \( f \) as a
map from the Riemann surface \( (\Sigma,[h_0]) \) to a Riemannian manifold \( (M,g) \).

In order to prove eqref:eq:var-var, just note that 
\begin{align*}
\frac{d}{dt}(\Enorm - 2\Anorm) &= \frac{d}{dt}\lim_{\epsilon\to 0}(E_\epsilon - 2A_\epsilon)\\
		      	      &= \lim_{\epsilon\to 0}\frac{d}{dt} \int_{\Sigma_\epsilon(f_t)} \tr_{h_0}f_t^* g dV_{h_0} - \tr_{h_t}f_t^* g dV_{h_t} \\
			      &= \lim_{\epsilon\to 0}\frac{d}{dt} \int_{\Sigma_\epsilon(f_t)} \left(\tr_{h_0}f_0^* g - \tr_{h_0}f_0^* g \frac{dV_{h_0}}{dV_{h_0}}\right) dV_{h_0} + \lim_{\epsilon\to 0}\frac{d}{dt} \int_{\Sigma_\epsilon(f_0)} \left(\tr_{h_0}f_t^* g - \tr_{h_t}f_t^* g \frac{dV_{h_t}}{dV_{h_0}}\right) dV_{h_0} \\
			      &= \lim_{\epsilon\to 0} \frac{1}{4} \int_{\Sigma_\epsilon(f_0)} \left\langle \re q(f_0,[h_0],g), \frac{dh_t}{dt} \right\rangle_{h_0} dV_{h_0}\\
			      &= \frac{1}{4} \int_{\Sigma} \left\langle \re q(f_0,[h_0],g), \frac{dh_t}{dt} \right\rangle_{h_0} dV_{h_0}
\end{align*}
where we applied eqref:eq:var-var-1 in the 4th equality.



* First variation of renormalised energy. <2018-10-26 Fri>  :noexport:
** The results.

  I will start by writing down the result before giving the proofs. Let \( (\Sigma,i) \)
  be a Riemann surface and \( (M,g) \) be an asymptotically hyperbolic Riemannian
  four-manifold. We are interested in critical points of renormalised energy \( \Enorm \)
  because these maps form a special class among harmonic maps whose energy is critical to all
  pertubation (and not just compact pertubation).

  Even though we obtained an explicit formula for renormalised energy where a density appears
  \[
  \Enorm = -4\pi\chi + \int_\Sigma \left[ 2K(f^*g)\sqrt{{\rm det}_h f^*g} + \tr_h f^*g \right] dA_h,
  \]
  it is not easy to compute its variation directly from it. The following
  approach gives us a formula that although is not explicit, allows us to see the
  following phenomenon.
  #+ATTR_LATEX: :options [Critical points of \(\Enorm\) = Harmonic + good germ on the boundary]
  #+ATTR_HTML: :id thm:crit-Enorm-bndry-germ :btit (Critical points of \(\Enorm\) = Harmonic + good germ on the boundary) 
  #+BEGIN_theorem
  #+LATEX: \label{thm:crit-Enorm-bndry-germ}
  Let \( f: (\Sigma,i) \longrightarrow (M,g) \) be a harmonic map from a Riemann surface \( \Sigma \) to
  a AH Riemannian four-manifold \( M \) such that \( q(f)_{\bar g} = 0 \) on \( \partial\Sigma \). There is a boundary quantity \( \mathcal{B}_2(f)
  \) that only concerns the germ of \( f \) on \( \partial\Sigma \) such that:
  #+BEGIN_CENTER
  \( f \) is critical to \( \Enorm \) if and only if \( \mathcal{B}_2(f) = 0 \).
  #+END_CENTER
  #+END_theorem

  We know that the \( \epsilon \)-energy must be writen as
  \[
   E_\epsilon (f) = \frac{1}{\epsilon} {\rm length}(\gamma) + \Enorm + O(\epsilon)
  \]
  where \( \gamma\) is the boundary curve of \( f\) and the length is taken under the
  metric \( \bar g \). Now given a pertubation \( \{f_t\} \) of \( f_0 \), we can recover
  the variation of \( \Enorm \) by looking at the \( O(1) \) term of \(
  \frac{dE_\epsilon}{dt}(f_t) \). It turns out that in order to compute the variation of
  \( E_\epsilon \), we only need to do the following 2 tasks:
  - Extend the computation made by Eells-Sampson cite:eells_harmonic_1964 to manifold with boundary.
  - Take care of the variation of the domain of integration \( \Sigma_\epsilon(f_t):=
    f_t^{-1}(r\geq\epsilon) \) which also depends on \( t \) where \( r \) is the boundary
    defining function (bdf).

  #+ATTR_LATEX: :options [Variation of \( E_\epsilon \)]
  #+ATTR_HTML: :id prop:var-Eeps :btit (Variation of \( E_\epsilon \)) 
  #+BEGIN_proposition
  #+LATEX: \label{prop:var-Eeps}
  For any pertubation \( \{f_t\} \) of \( f: (\Sigma,\partial\Sigma,i) \longrightarrow (M,\partial M,g) \), one has
  \begin{equation}
  \label{eq:var-Eeps}
  \frac{d}{dt}E_\epsilon(f_t) = \int_{\Sigma_\epsilon(f_0)} \left\langle \tau(f_0), \frac{df_t}{dt} \right\rangle_g dV_h + \frac{1}{\epsilon^2}\int_{\partial\Sigma_\epsilon(f_0)}\left \langle 2 \frac{\partial f_0}{\partial n} + \frac{\nabla^g r(f_0)}{|d(r\circ f_0)|_h} \tr_h (f_0^*g) , \frac{df_t}{dt}\right \rangle_{\bar g} ds_h  
  \end{equation}
  where 
   - \( h \) is a metric in the conformal class \( i \) of \( \Sigma \),
   - \( \frac{\partial}{\partial n} \) is the \( h \)-unit normal vector of \( \partial\Sigma_\epsilon(f_0) \) in \(
     \Sigma_\epsilon(f_0) \),
   - \( \tau(f_0) \) is the tension field of \( f_0 \) with respect to the metric \( h \)
     on \( \Sigma \) and \( g \) on \( M \).
  Denote \( \mathcal{B} := \int_{\partial\Sigma_\epsilon(f_0)}\left
  \langle 2 \frac{\partial f_0}{\partial n} + \frac{\nabla^g r(f_0)}{|d(r\circ f_0)|_h}\tr_h(f_0^*g)  ,
  \frac{df_t}{dt}\right \rangle_{\bar g} ds_h =: \mathcal{B}_0 + \mathcal{B}_1 \epsilon +
  \mathcal{B}_2 \epsilon^2 + O(\epsilon^3) \) then 
   - \( \mathcal{B}_i \) only depends on the germ of \( f_0 \) on \( \partial\Sigma \)
   - \(\mathcal{B}_0 = 2\int_{\partial\Sigma}\left \langle \frac{\partial f_0}{\partial n} +
     \frac{\nabla^{\bar g}r(f_0)}{|\nabla^{\bar g}r(f_0)|_{\bar g}}, \frac{df_t}{dt}\right
     \rangle_{\bar g} ds_h = 0\) where \( n \) is the \( f^* \bar g \)-normal vector of \( \Sigma \) on
     the boundary.
   #+END_proposition

  As a straightforward consequence, one has
  #+ATTR_LATEX: :options []
  #+ATTR_HTML: :id prop: :btit () 
  #+BEGIN_proposition
  #+LATEX: \label{prop:}
  Given a map \( f: (\Sigma, \partial\Sigma, i) \longrightarrow (M, \partial M, g) \), then:
   1. \( f_0 \) is harmonic and \( \mathcal{B}_2(f_0) = 0 \) if and only if \( f_0 \) is a
      critical point of \( \Enorm \).
   2. The first variation of \( \Enorm \) can be writen as:
      \begin{align*}
      \frac{d \Enorm}{dt}(f_t) &= \int_{\Sigma} \left\langle \tau(f_0),
      \frac{df_t}{dt} \right\rangle_g dV_h  \\ &+
      \lim_{\epsilon\to 0} \frac{1}{\epsilon^2} \left
      [\int_{\partial\Sigma_\epsilon(f_0)}\left \langle 2
      \frac{\partial f_0}{\partial n} + \frac{\nabla^g r(f_0)}{|d(r\circ f_0)|_h} \tr_h(f_0^*g)  ,
      \frac{df_t}{dt}\right \rangle_{\bar g} ds_h +  \int_{\Sigma_\epsilon(f_0)} \left
      \langle \nabla^{\bar g}_{\dot\gamma} \frac{\dot\gamma}{|\dot\gamma|_h} ,
      \frac{df_t}{dt}\right \rangle_{\bar g}\right]      
      \end{align*}

      where \( \gamma \) is the boundary curve of \( f \), \( \frac{\partial}{\partial n}
      \) is the \( h \)-unit normal vector of \( \partial\Sigma_\epsilon \) in \( \Sigma_\epsilon \).
  #+END_proposition
  
  
