pages/writings.org
** Proofs.
   We [[ref:Eells-Sampson-bndry]] knew that the variation of energy functional can be represented by the tension field, in
   case of manifolds with boundary, we obtain an additional term from Stokes formula: 
   \begin{align}
      \frac{d}{dt}E_\epsilon(f_t) &= \frac{d}{dt}\int_{\Sigma_\epsilon(f_0)} \tr_h (f_t^* g) +   \frac{d}{dt}\int_{\Sigma_\epsilon(f_t)} \tr_h (f_0^*g)\\
      				  &= \int_{\Sigma_\epsilon(f_0)} \left \langle \tau(f_0), \frac{df_t}{dt} \right \rangle_g dV_h + 2\int_{\partial\Sigma_\epsilon(f_0)} \left \langle \frac{\partial f_0}{\partial n}, \frac{df_t}{dt}\right \rangle_g + \frac{d}{dt} \int_{\Sigma_\epsilon(f_t)} \tr_h( f_0^* g) dV_h
   \end{align}
   Equation eqref:eq:var-Eeps is a straightforward application of the
   following lemma for \( \Omega_t = \Sigma_\epsilon(f_t)\), \(F=\tr_h(f_0^* g) \) and \( r_t = r\circ f_t \).

   #+ATTR_LATEX: :options [Riemannian Cavalieri]
   #+ATTR_HTML: :id lem:var-domain :btit (Riemannian Cavalieri) 
   #+BEGIN_lemma
   #+LATEX: \label{lem:var-domain}
   Let \( \Omega \) be a domain in \( \Sigma \) and  \( \{r_t\}_{t=\overline{0,1}} \) be a familly of functions on \( \Omega \) where \(
   dr_t \) are non-zero and \( \Omega_t\subset \Omega \) be subdomains of \( \Omega \) defined by \( \Omega_t =
   \{r_t \geq \epsilon\}\). Then for any function \( F \) on \( \Omega \), one has
   \[
   \restr{\frac{d}{dt}}{t=0}\int_{\Omega_t}F dV_h = \int_{\partial\Omega_0}
   \frac{r_1}{|\nabla^h r_0|_h}F ds_h
   \]
   where \( r_1 = \restr{\frac{dr_t}{dt}}{t=0} \).
   #+END_lemma

   
   #+BEGIN_proof
   Let us prove the lemma in case \( \Omega_t \) only has one connected component with
   non-empty interior, since
   the number of such components does not change for \( t \) near 0 (this is because
   \( r_0 \) has no critical point in \( \Omega \)). Let
   us also suppose that \( r_1 \geq 0 \) meaning that the domain \( \Omega_t \)
   becomes bigger as \( t \) increases from \( 0 \). This is because one can always
   partition the curve \(\gamma = \partial\Omega_0 \) into pieces where \( r_1>0, r_1 <0 \) or \( r_1=0 \)
   and the area difference of pieces touching the \( r_1=0 \) parts is of \( O(t^2) \). 

   The difference \( \Omega_t\setminus \Omega_0 \) is the region where \( \epsilon -r_1 t+
   O(t^2)\leq r_0 \leq \epsilon \), therefore \( \Omega_t\setminus \Omega_0 \) is of \(
   O(t^2) \) difference from the region \( \Phi_t = \{ \exp_{\gamma(s)}\frac{\theta r_1\nabla^h
   r_0}{|\nabla^h r_0|^2}:\theta \in[0,t], s\in[0,1] \} \). Therefore
   \[
   \restr{\frac{d}{dt}}{t=0}\int_{\Omega_t}F dV_h
   =\restr{\frac{d}{dt}}{t=0} \int_0^t \int_{\gamma} F \frac{r_1}{|\nabla^h r_0|_h} \text{vol }ds_h d\theta = \int_{\gamma} F\frac{r_1}{|\nabla^h r_0|_h} ds_h .
   \]
   where \(  \frac{r_1}{|\nabla^h r_0|_h}\text{vol}(s,\theta) ds_h d\theta \) is the
   pullback of the volume form by exponential map
   \( (s,\theta)\mapsto \exp_{\gamma(s)} \frac{\theta r_1\nabla^h r_0}{|\nabla^h r_0|_h^2}
   \), so \( \text{vol}(s,0) = 1 \).
   #+END_proof
   



* Another formula for \( \Enorm\). Harmonic maps are critical points of \( \Enorm \) under stronger vanishing condition. :noexport: 
** Review of Alexakis--Mazzeo. Another formula of \( \Enorm \)
Alexakis and Mazzeo obtained a formula for renormalised area \( \Anorm \) by rewriting 
\[
 A_\epsilon = \int_{\Sigma_\epsilon}1 dA = \int_{\Sigma_\epsilon}(1 + K)dA - \int_{\Sigma_\epsilon}KdA
\]
where \( K \) is the Gauss curvature of the restriction of the metric \( g \) on \( \Sigma
\). They then 
- use Gauss--Codazzi formula and Ei
nstein equation to rewrite \( 1+K \) in term of
  second fundamental form to prove that \( \int_{\Sigma_\epsilon}(1+K)dA \) converges to a
  finite limit as \( \epsilon\to 0 \)
- use Gauss--Bonnet formula to rewrite \( \int_{\Sigma_\epsilon}KdA = 2\pi\chi -
  \int_{\partial\Sigma_\epsilon}\kappa ds \)  where \( \chi \) is Euler characteristic of
  \( \Sigma \) and \( \kappa \) is the geodesic curvature of the boundary curve \(
  \partial\Sigma_{\epsilon} \) w.r.t the surface \( \Sigma_\epsilon \). Then prove that
  the integral \(
  \int_{\partial\Sigma_\epsilon}\kappa ds = \frac{{\rm
  length}(\partial\Sigma_\epsilon)}{\epsilon} + O(\epsilon) \)
Therefore \( \Anorm \) can be expressed as
\[
 \Anorm = -2\pi\chi + \lim_{\epsilon\to 0}(A_\epsilon + K_\epsilon) = -2\pi\chi+ \int_{\Sigma}(1+K)dA
\]
where \( K_\epsilon = \int_{\Sigma_\epsilon}KdA \).


We [[ref:existence-enorm][proved]] that \( E_\epsilon - 2A_\epsilon \) has a finite limit as \( \epsilon\to 0 \),
i.e. \( \Enorm -2 \Anorm = \lim_{\epsilon\to 0} (E_\epsilon - 2A_\epsilon) \)
so \( \Enorm = -4\pi\chi + \lim_{\epsilon\to 0}(E_\epsilon + 2K_\epsilon) \), or
\begin{equation}
\label{eq:enorm-simple}
 \Enorm = -4\pi\chi + \int_\Sigma \left[ 2K(f^*g)\sqrt{{\rm det}_h f^*g} + \tr_h f^*g \right] dA_h
\end{equation}
where \( h \) is the metric on \( \Sigma \), \( g \) is the AH metric on \( M \), \( K(f^*g) \)
is the Gauss curvature of \( (\Sigma, f^*g) \)

#+BEGIN_remark
The expression eqref:eq:enorm-simple does not make it obvious that \( \Enorm \) is
finite. It is however simpler and it allows us to see that \( \Enorm \) only depends on \( f^* g \), the
restriction of \( g \) on the surface, and not the entire metric \( g \).
#+END_remark



** Eells--Sampson with boundary label:Eells-Sampson-bndry
Eells and Sampson proved that the variation of energy \( E = \int_{\Sigma}|df|^2 \) of a
map \( f: (\Sigma,h) \longrightarrow (M,g) \) between Riemannian manifolds without
boundary is given by
\[
 \frac{d}{dt}E(f_t) = \int_\Sigma \left\langle \tau(f_0), \frac{df_t}{dt} \right\rangle_g dV_h
\]
where they applied Stokes' formula once in their computation. 

In case of manifold with
boundary, the variation of \( E \) should be given by
\[
 \frac{d}{dt}E(f_t) = \int_{\Sigma} \left\langle \tau(f_0),\frac{d f_t}{dt}\right
\rangle_g dV_h + 2\int_{\partial\Sigma} \left\langle \frac{\partial f}{\partial n} , \frac{d
f_t}{dt} \right\rangle_g dA_h
\]

In our case, if \( \{f_t\} \) is a perturbation of \( f_0: (\Sigma,h) \longrightarrow
(M,g) \) with the same boundary curve \( \restr{f_t}{\partial\Sigma} \), but not
necessarily of compact support, one has
\begin{equation}
\label{eq:eells-sampson-bndry}
\frac{d E_\epsilon(f_t)}{dt} = \int_{\Sigma_\epsilon} \left \langle\tau(f_0), \frac{d
f_t}{dt} \right \rangle_g dA_h + 2\int_{\partial\Sigma_\epsilon(f_0)} \left\langle
\frac{\partial f_0}{\partial n}, \frac{d f_t}{dt}\right \rangle_g ds_h
\end{equation}
where \( n \) is the outward \( h \)-normal vector of \( \partial\Sigma_\epsilon \) in \(
\Sigma_\epsilon \).

In case of compact perturbation, the boundary term vanishes when \( \epsilon \) is
sufficiently small, it follows that if \( f_0 \) is a critical point of \( \Enorm \) then

\( f_0 \) is harmonic.

