html/writings.html


<div id="outline-container-orgd11abe7" class="outline-2">
<h2 id="orgd11abe7"><span class="section-number-2">1</span> Another formula for \( \Enorm\). Harmonic maps are critical points of \( \Enorm \) when \( |q(f)_g| \) vanishes on \( \partial \Sigma \).</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgff378a1" class="outline-3">
<h3 id="orgff378a1"><span class="section-number-3">1.1</span> Review of Alexakis&#x2013;Mazzeo. Another formula of \( \Enorm \)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Alexakis and Mazzeo obtained a formula for renormalised area \( \Anorm \) by rewriting 
\[
 A_\epsilon = \int_{\Sigma_\epsilon}1 dA = \int_{\Sigma_\epsilon}(1 + K)dA - \int_{\Sigma_\epsilon}KdA
\]
where \( K \) is the Gauss curvature of the restriction of the metric \( g \) on \( \Sigma
\). They then 
</p>
<ul class="org-ul">
<li>use Gauss&#x2013;Codazzi formula and Einstein equation to rewrite \( 1+K \) in term of
second fundamental form to prove that \( \int_{\Sigma_\epsilon}(1+K)dA \) converges to a
finite limit as \( \epsilon\to 0 \)</li>
<li>use Gauss&#x2013;Bonnet formula to rewrite \( \int_{\Sigma_\epsilon}KdA = 2\pi\chi -
  \int_{\partial\Sigma_\epsilon}\kappa ds \)  where \( \chi \) is Euler characteristic of
\( \Sigma \) and \( \kappa \) is the geodesic curvature of the boundary curve \(
  \partial\Sigma_{\epsilon} \) w.r.t the surface \( \Sigma_\epsilon \). Then prove that
the integral \(
  \int_{\partial\Sigma_\epsilon}\kappa ds = \frac{{\rm
  length}(\partial\Sigma_\epsilon)}{\epsilon} + O(\epsilon) \)</li>
</ul>
<p>
Therefore \( \Anorm \) can be expressed as
\[
 \Anorm = -2\pi\chi + \lim_{\epsilon\to 0}(A_\epsilon + K_\epsilon) = -2\pi\chi+ \int_{\Sigma}(1+K)dA
\]
where \( K_\epsilon = \int_{\Sigma_\epsilon}KdA \).
</p>


<p>
We <a href="#existence-enorm">proved</a> that \( E_\epsilon - 2A_\epsilon \) has a finite limit as \( \epsilon\to 0 \),
i.e. \( \Enorm -2 \Anorm = \lim_{\epsilon\to 0} (E_\epsilon - 2A_\epsilon) \)
so \( \Enorm = -4\pi\chi + \lim_{\epsilon\to 0}(E_\epsilon + 2K_\epsilon) \), or
</p>
\begin{equation}
\label{eq:enorm-simple}
 \Enorm = -4\pi\chi + \int_\Sigma \left[ 2K(f^*g)\sqrt{{\rm det}_h f^*g} + \tr_h f^*g \right] dA_h
\end{equation}
<p>
where \( h \) is the metric on \( \Sigma \), \( g \) is the AH metric on \( M \), \( K(f^*g) \)
is the Gauss curvature of \( (\Sigma, f^*g) \)
</p>

<div class="remark">
<p>
The expression \eqref{eq:enorm-simple} does not make it obvious that \( \Enorm \) is
finite. It is however simpler and it allows us to see that \( \Enorm \) only depends on \( f^* g \), the
restriction of \( g \) on the surface, and not the entire metric \( g \).
</p>

</div>
</div>
</div>



<div id="outline-container-org93fcd48" class="outline-3">
<h3 id="org93fcd48"><span class="section-number-3">1.2</span> Eells&#x2013;Sampson with boundary</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Eells and Sampson proved that the variation of energy \( E = \int_{\Sigma}|df|^2 \) of a
map \( f: (\Sigma,h) \longrightarrow (M,g) \) between Riemannian manifolds without
boundary is given by
\[
 \frac{d}{dt}E(f_t) = -\int_\Sigma \left\langle \tau(f_0), \frac{df_t}{dt} \right\rangle_g dV_h
\]
where they applied Stokes' formula once in their computation. 
</p>

<p>
In case of manifold with
boundary, the variation of \( E \) should be given by
\[
 \frac{d}{dt}E(f_t) = -\int_{\Sigma} \left\langle \tau(f_0),\frac{d f_t}{dt}\right
\rangle_g dV_h + 2\int_{\partial\Sigma} \left\langle \frac{\partial f}{\partial n} , \frac{d
f_t}{dt} \right\rangle_g dA_h
\]
</p>

<p>
In our case, if \( \{f_t\} \) is a perturbation of \( f_0: (\Sigma,h) \longrightarrow
(M,g) \) with the same boundary curve \( \restr{f_t}{\partial\Sigma} \), but not
necessarily of compact support, one has
</p>
\begin{equation}
\label{eq:eells-sampson-bndry}
\frac{d E_\epsilon(f_t)}{dt} = \int_{\Sigma_\epsilon} \left \langle\tau(f_0), \frac{d
f_t}{dt} \right \rangle_g dA_h + 2\int_{\partial\Sigma_\epsilon(f_0)} \left\langle
\frac{\partial f_0}{\partial n}, \frac{d f_t}{dt}\right \rangle_g ds_h
\end{equation}
<p>
where \( n \) is the outward \( h \)-normal vector of \( \partial\Sigma_\epsilon \) in \(
\Sigma_\epsilon \).
</p>

<p>
In case of compact perturbation, the boundary term vanishes when \( \epsilon \) is
sufficiently small, it follows that if \( f_0 \) is a critical point of \( \Enorm \) then
\( f_0 \) is harmonic.
</p>
</div>
</div>
