pages/writings.org
** Critical points of \( \Enorm \)
We will prove, modulo a justification to pass the limit inside an integral, that if we
restrict to perturbations \( \{f_t\} \) with vanishing quadratic differential \( q(f_t)_g = 0
\) (the stronger vanishing condition) then \( f_0 \) is a critical point of \( \Enorm \)
if and only if it is harmonic. In fact we will prove that

\begin{equation}
\label{eq:var-Eep}
 \frac{d E_\epsilon(f_t)}{dt} = \int_{\Sigma_\epsilon} \left
 \langle \tau(f_0),\frac{df_t}{dt} \right \rangle_g dA_h
\end{equation}

for any admissible perturbation \( \{f_t\} \). 

Since \( \Enorm = E_\epsilon
 -\frac{l}{\epsilon} + O(\epsilon) \) where \( l \) is the length of the boundary curve,
 by interchanging the limit and integral sign, one sees that \( \frac{d}{dt}\Enorm (f_0) = \lim_{\epsilon\to 0}
 \frac{d}{dt}E_\epsilon(f_0) \), hence any harmonic map is a critical point of \( \Enorm
 \).

#+BEGIN_remark
It follows from the development in our toy model (see the next paragraph) that \( |\frac{df_t}{dt}|_g =
O(\epsilon^2)O(\epsilon^{-1}) = O(\epsilon) \). Let us suppose that \( h  = f^*g \) (since \( E_\epsilon \) is a conformal invariance with respect to \( h \) and the
quadratic differential vanishes near the boundary), then Alexakis--Mazzeo proved that
\( |\tau(f_0)|_g = O(\epsilon) \). Therefore \( \left
 \langle \tau(f_0),\frac{df_t}{dt} \right \rangle_g dA_h = O(1)  \) and the integral on
RHS of eqref:eq:var-Eep is finite.
#+END_remark

#+BEGIN_proof
By eqref:eq:eells-sampson-bndry, we only need to prove that the boundary integral tends to
0 as \( \epsilon \to 0 \). Let us prove this in our toy model \( f_t: \mathbb{H}^2
\longrightarrow \mathbb{H^k} \) where \( \mathbb{H}^2 \) is coordinated by \( (u,s)\in
\mathbb{R}_{\geq 0}\times \mathbb{R} \)
and \( \mathbb{H^k} \) is coordinated by \( (x,y^i)\in \mathbb{R}_{\geq 0}\times
\mathbb{R}^{k-1} \). Suppose that \( f_t \) are given by
\[
 x = au +bu^2 +\dots,\qquad y^i = \gamma^i + W^iu^2 + \dots
\]
where \( b, W^i \) depend on \( t \), \( \gamma^i \) and \( a \) do not depend on \( t \)
because we fixed the boundary curve \( \gamma \) and \( \restr{q(f)_{\bar g}}{\partial
\mathbb{H}^2}=0 \) (the weaker vanishing condition) implies \( a^2 = |\dot\gamma|^2 \). It
follows that \( \frac{df_t}{dt} = u^2 (b_t \frac{\partial}{\partial x} + W^i_t
\frac{\partial}{\partial y^i}) + O(u^3) \).

It is also straightforward to check that \( \frac{\partial f}{\partial n} = a
\frac{\partial}{\partial x}+ O(u) \). Therefore 
\[
 \left \langle \frac{\partial f}{\partial n}, \frac{df_t}{dt} \right \rangle_g = b_t a
O(1) + O(u)
\]

The stronger vanishing condition \( \restr{q(f)_g}{\partial \mathbb{H}^2} \) implies \(
b=0 \) for all admissible \( \{f_t\} \), one has \( b_t=0 \) and therefore \(  \left
\langle \frac{\partial f}{\partial n}, \frac{df_t}{dt} \right \rangle_g= O(u) \). It
follows that the boundary integral in eqref:eq:eells-sampson-bndry tends to \( 0 \) as \(
\epsilon\to 0 \).

#+END_proof




* Existence and invariance by special bdf of the renormalised energy.  label:existence-enorm :noexport:

Let \( f: (\Sigma, \partial\Sigma) \longrightarrow  (M,\partial M) \) be smooth map
from a Riemann surface to an asymptotically hyperbolic manifold \( M \). Let \( r \) be a
special bdf of \( M \), \( \bar g = r^2 g \) be the metric underwhich \( M \) is compact, and \( A_\epsilon(f), E_\epsilon(f) \) be the area and energy of \(
f \) in the region \( r\geq \epsilon \) as a map from \( (\Sigma,h) \) to \( (M,g) \)
for any choice of metric \( h \) in the natural conformal class of \( \Sigma \). 

Denote by 
 - \( q(f)_{g} \) and \( q(f)_{\bar g} = r^2 q(f)_{g} \) the quadratic differentials of \( f \) from the Riemann surface \( \Sigma \) to the Riemannian manifolds \( (M, g) \) and \( (M,\bar g) \) respectively.
 - \( |q(f)_g| \) and \( |q(f)_{\bar g}| \) their norm under \( h \).

We will prove that

#+ATTR_LATEX: :options [Renormalised energy]
#+ATTR_HTML: :id prop:renorm-en :btit (Renormalised energy) 
#+BEGIN_proposition
#+LATEX: \label{prop:renorm-en}
Under no further supposition, one has
\begin{align}
  E_{\epsilon}(f)-2A_\epsilon(f) &= \frac{1}{4} \int_{r\geq\epsilon}\frac{1}{r^2} \frac{|q(f)_{\bar g}|^2}{\tr_h(f^* \bar g) + 2 \sqrt{\det_h(f^* \bar g)}} dA_h \label{eq:en-1}\\
       &= \frac{1}{4}\int_{r\geq\epsilon} \frac{|q(f)_{g}|^2}{\tr_h(f^* g) + 2 \sqrt{\det_h(f^* g)}}dA_h \label{eq:en-2}
\end{align}
One can see from eqref:eq:en-1 that if the quadratic differential of \( f \) vanishes on
\( \partial \Sigma \) then \( |q(f)_{\bar g}|^2 = O(r)^2 \) and the integral increases to
a finite limit as \( \epsilon \to 0 \). Meanwhile eqref:eq:en-2 shows that this limit,
which is the difference between the renormalised energy and renormalised area is
independent of the special bdf \( r \).
#+END_proposition

We remark that the two integrals only depend on the conformal class of \( h \) and the
denominators are sums of densities of energy and area of \( f \) under \( \bar g \) and \(
g \) respectively.

#+BEGIN_proof
It suffices to prove eqref:eq:en-2, which means, at any point \( P \) of \( \Sigma \)
\[
 \tr_h(f^*g)^2 - 4{\rm det}_{h}(f^*g) = \frac{1}{4}|q(f)_g|^2
\]
Under any holomorphic coordinates \( x,y \) centered at \( P \), one has:
\[ 
q(f)_g = \left(\left|\frac{\partial f}{\partial x}\right|^2_g - \left|\frac{\partial f}{\partial y}\right|^2_g - 2i
\langle \frac{\partial f}{\partial x}, \frac{\partial f}{\partial y} \rangle_g\right)
dz\otimes dz\]
hence
\[
\frac{1}{4}\left|q(f)_g\right|^2 = (f^\alpha_x f^\beta_x g_{\alpha\beta} - f^\alpha_y f^\beta_y
g_{\alpha\beta})^2 + 4(f^\alpha_xf^\beta_y g_{\alpha\beta})^2
\]

Moreover
\[
 \tr_h(f^*g) = f^\alpha_x f^\beta_x g_{\alpha\beta} + f^\alpha_y f^\beta_y g_{\alpha\beta}  
\]
and
\[
 {\rm det}_h(f^*g) = f^\alpha_x f^\beta_x g_{\alpha\beta}f^\gamma_yf^\delta_y
g_{\gamma\delta}-f^\alpha_x f^\beta_y g_{\alpha\beta}f^\gamma_xf^\delta_y g_{\gamma\delta}
\]
The result follows.
#+END_proof

Therefore the renormalised energy \( E_{\rm norm} \) is given by 
\begin{align}
   E_{\rm norm} &= 2A_{\rm norm} + \frac{1}{4}\int_\Sigma \frac{|q(f)_g|^2}{\tr_h (f^*g) + 2\sqrt{\det_{h}(f^*g)}}dA_h\\
   	  	&= -4\pi\chi(f(\Sigma)) + \int_{f(\Sigma)}(2W_{1212}+ 2|H|^2 - |\hat k|^2) + \frac{1}{4}\int_\Sigma \frac{|q(f)_g|^2}{\tr_h (f^*g) + 2\sqrt{\det_{h}(f^*g)}}dA_h
\end{align}
according Alexasky-Mazzeo [[https://arxiv.org/abs/0802.2250][formula]] for renormalised area.


#+ATTR_HTML: :id rem:compact-perb
#+BEGIN_remark
#+LATEX: \label{rem:compact-perb}
Let \( \{f_t\} \) be a perturbation of \( f \) with compact support lying outside of
\(r\leq \epsilon_0 \). Then since \( E_\epsilon(f_t) - E_\delta(f_t) =  E_\epsilon(f) -
E_\delta(f) \) for all \( t \), one has
\[
 E_\epsilon(f_t) - E_\epsilon(f) = E_{\rm norm}(f_t) - E_{\rm norm}(f).
\]

Because harmonicity of \( f \) means that \( f \) is critical point of \( E_\epsilon  \) on
\( r\geq \epsilon \) for all \( \epsilon \) arbitrarily closed to 0, it follows that any critical point of \(
E_{\rm norm} \) is harmonic.
#+END_remark





