pages/writings.org
* Log term in energy: half-sphere in \( \mathbb{H}^3 \).  :noexport:
The following example concerns a compact surface (a half-sphere) in \( \mathbb{H}^3 \) (so
there is no subtlety of its boundary in Poincaré's \( \mathbb{H}^3 \) or
\(\mathbb{D}^3\)).

Let \( \mathbb{D}^2 \) be the unit disk coordinated by \( (s,\theta)\in [0,1)\times
[0,2\pi)  \) and \( \mathbb{H}^3 \) be the Poincaré half-space coordinated by \(
(x_0,r,\theta)\in (0,+\infty)\times [0,+\infty)\times [0,2\pi) \). Consider the map \( f:
\mathbb{D}^2 \longrightarrow \mathbb{H}^3 \) given by 
\[
 (s,\theta) \longmapsto \left( \frac{1-s^2}{1+s^2}, (\frac{2s}{1+s^2},\theta) \right)
\]
which is the totally geodesic imbedding of \( (\mathbb{D}^2,\text{Poincaré}) \) into \(
(\mathbb{H}^3,\text{Poincaré}) \). One can verify that if \( g = \frac{1}{x_0^2} (dx_0^2 +
dr^2 + r^2d\theta^2) \) is the Poincaré metric on \( \mathbb{H}^3 \) then
\[
 f^* g = \frac{4}{(1-s^2)^2} (ds^2 + s^2 d\theta^2)
\]
is the Poincaré metric on \( \mathbb{D}^2 \).

We will equip \( \mathbb{D}^2 \) with the following metric
\[
 g_A = dx^2 + dy^2 + 2A dxdy = (1+A\sin 2\theta) ds^2 + s^2 (1-A\sin 2\theta) d\theta^2 +
2As\cos 2\theta ds d\theta
\]
where \( A \) is a suitable smooth function on \( \mathbb{D}^2 \) with \( |A|< 1 \). We
will show that when \( A:=\frac{2s^2}{1+s^4} \) then there will be a \( \ln\epsilon \)
term in the energy of \( f: (\mathbb{D}^2,g_A) \longrightarrow (\mathbb{H}^3,
g=\text{Poincaré}) \).


#+BEGIN_proof
One can check that \( \det
(g_A) = s^2(1-A^2) \) and the contravariant metric is
\[
 (g_A)^{ij} = \frac{1}{s^2 (1-A^2)}\begin{bmatrix}s^2 (1-A\sin 2\theta) & -As\cos 2\theta\\-As\cos 2\theta &
1+A\sin 2\theta\end{bmatrix}
\]

The trace of the pullback metric \( f^*g \) under the metric \( g_A \) is
\[
 \tr_{g_A} (f^*g) = \frac{8}{(1-s^2)^2}.\frac{1}{1-A^2}
\]
Therefore
\[
E_\epsilon(f) := \int_{x_0\geq \epsilon} \tr_{g_A}(f^* g) \sqrt{|\det g_A|} ds d\theta = \int_{x_0\geq
\epsilon} \frac{8}{\sqrt{1-A^2}}.\frac{s}{(1-s^2)^2} ds d\theta
\]


Take \( A:= \frac{2s^2}{1+s^4} \) then \( \sqrt{1-A^2} = \frac{1-s^4}{1+s^4} \) and 
\[
E_\epsilon(f) = 8\pi \int_{y\leq y_{\max}} \frac{1+y^2}{1-y^2}.\frac{1}{(1-y)^2} dy
\]
where \( y=s^2 \) running from \( 0 \) to \( y_{\max}=\frac{1-\epsilon}{1+\epsilon} \).

By writing the rational function as
\[
 \frac{1+y^2}{(1-y^2)(1-y)^2} = -\frac{1}{2} .\frac{1}{(1-y)^2} + \frac{1}{(1-y)^3} +
\frac{1}{4}.\frac{1}{1+y} + \frac{1}{4}.\frac{1}{1-y},
\]
one sees that
\[
 E_\epsilon(f) = \frac{\pi}{\epsilon^2} + \frac{4\pi}{\epsilon} -2\pi \ln\epsilon - 5\pi.
\]
#+END_proof

Let us reuse the formula
\[
 E_\epsilon(f) = \int_{x\geq \epsilon} \frac{8}{\sqrt{1-A^2}} \frac{s}{(1-s^2)^2}dsd\theta
 = 8\pi\int_{z\geq z_{\min}} \frac{1}{B(z)} \frac{1}{z^2}dz
\]
where \( z = 1-s^2 \) running from \( z_{\min} = \frac{2\epsilon}{1+\epsilon} \) to \( 1
\) and \( B = \sqrt{1-A^2} \).

Let us assume that 
 - \( A \) is at least \( C^1 \) on \( z = 1-s^2 \),
 - \( A \) tends to \( 0 \) near the boundary circle, i.e. when \( z\to 0 \),
The second assumption is equivalent to \( B(z=0) = 1 \) and the first assumption at \( z=0
\) (given that the second holds) is equivalent to \( B'(z=0) = 0 \). So \( B = 1 + az^2 + O(z^3) \) 

Trying to integrate \( \frac{1}{z^2 (z-a)(z-b)(z-c)} \) when \( abc=1 \) and \( ab+bc+ca=0
\), one sees that there is no \( \ln z \) term (there may be \( \ln(z+\omega) \) with \(
\omega\ne 0 \) term though).

#+ATTR_HTML: :id rem:cond-A-bndry
#+BEGIN_remark
#+LATEX: \label{rem:cond-A-bndry}
So an appropriate condition to add (so that there is no \( \ln\epsilon \) term in the
energy) is that \( A\to 0 \) near the boundary circle, meaning that \( f \) is 
conformal at the boundary.
#+END_remark



* Log term in energy of \( f: \overline{\mathbb{H}^2} \longrightarrow \overline{\mathbb{H}^{n+1}} \).  :noexport:
Let \(\mathbb{H}^2 \) be coordinated by \( (t,s) \) with \( t>0,s\in \mathbb{R} \) and \( \mathbb{H}^{n+1} \) be cordinated by \( x> 0, y^1,\dots, y^n\in \mathbb{R} \).

Define \( f: \overline{\mathbb{H}^2} \longrightarrow \overline{\mathbb{H}^{n+1}} \) by
\[
(t,s) \mapsto \left(t+t^2, \gamma^i(s)\right)
\]
whose image is the vertical cylinder over the curve \( s \mapsto (\gamma^i(s)) \).

#+BEGIN_exampl
If \( n=2 \), one can take \( (y^1,y^2) := \left(\frac{2s}{s^2+1},\frac{s^2-1}{s^2+1}
\right)  \). Its image is the unit circle in \( \{x=0\} \), only filled once as \( s \)
varies in \( \mathbb{R} \).
#+END_exampl

Now that 
\[
 dx = (1+2t)dt,\quad dy^i = \dot \gamma^i ds,
\]
the pullback by \( f \) of Poincaré metric \( g = \frac{1}{x^2}(dx^2 + \sum d{y^i}^2) \) on \(
\mathbb{H}^{n+1} \) is
\[
 f^* g = \frac{1}{t^2 (1+t)^2} \left( (1+2t)^2 dt^2 + \sum \dot {\gamma^i}^2(s) ds^2 \right)
\]
Its trace w.r.t the Euclidean metric on the half 2-plane is
\[
 \tr f^* g = \frac{(1+2t)^2}{t^2(1+t)^2} + \frac{\varphi(s)}{t^2(1+t)^2}
\]
where \( \varphi \) only depends on \( s \) and can be replaced by \( a^2\varphi \) for
any constant \( a>0 \) when one modifies the boundary curve \( \gamma \to a\gamma \)).

Integrate by \( s\in \mathbb{R} \) and \( t \) in \( (t_{\min},1) \) (we can suppose
\(t\leq 1 \) since we are only interested in the energy near boundary, \( t_{\min} =
\frac{-1 + \sqrt{1+4\epsilon}}{2} = \epsilon + O(\epsilon^2) \)):

\[
 \int_t \frac{1}{t^2} + \frac{1}{(1+t)^2} + \frac{2}{t(1+t)} + \const(\varphi) \left(
 \frac{1}{t^2} - \frac{2}{t(1+t)} + \frac{1}{(1+t)^2} \right)
\]
where \( \const(\varphi) \) can be scaled up \( a^2 \) times when one replaces \( \gamma
 \) by \( a\gamma \). Choose \( a \) so that the term \( \frac{2}{t(1+t)} \) remains,
 which integrates to \( \log t_{\min} = \log(\epsilon) + O(\epsilon) \).


#+ATTR_HTML: :id rem:bndry-condition
#+BEGIN_remark
#+LATEX: \label{rem:bndry-condition}
It is clear that one needs a certain regularity of \( f \) at boundary of the initial
space so that the \( \log\epsilon \) term does not appear. The "Poincaré half-plane to
Poincaré disk" transform is only smooth and diffeomorphic in the interior. The boundary map
\( (y^1,y^2) := \left(\frac{2s}{s^2+1},\frac{s^2-1}{s^2+1} \right) \) in the example above
(\( n=2 \)) is the restriction on boundary of the half-plane-to-disk transform.
#+END_remark


* Commutative diagram in \( \TeX \) revisited 
