pages/writings.org
** xypic and xyJax
To my knowledge, the only way to type commutative diagram on the web is to use ~xyJax~, a
third-party extension of ~MathJax~ that render diagram using ~xypic~. This is also how
[[https://stacks.math.columbia.edu/][Stacks Project]] was set up.

The syntax of ~xypic~ is almost the same as ~tikz-cd~, to a basic user the only difference
is how arrows are typed. I learn ~xypic~ syntax by rewriting a GUI editor for ~tikzcd~ by
[[https://tikzcd.yichuanshen.de][Yichuan Shen]] to output ~xypic~ code. [[https://darknmt.github.io/res/xypic-editor/][Here]] is the ~xypic~ version of the editor. I also
host a copy of the ~tikz-cd~ editor [[http://darknmt.github.io/res/tikzcd-editor][here]].

The configuration of ~xyJax~ or any third-party extension MathJax was not very easy for
 me, since it seems that MathJax CDN no longer hosts third-party extensions. So I have to
 host my own copy of ~xyJax~ and tell MathJax CDN to use it, as indicated in [[http://docs.mathjax.org/en/latest/options/ThirdParty.html][its
 documentation]]. Also, one also has to [[https://github.com/sonoisa/XyJax/blob/master/README.md][reconfig a path]] in ~xyJax~.

To config MathJax in org-mode, apropos ~org-html-mathjax-template~.

* LaTeX in Inkscape: Incompatibility between ~ghostscript~ and ~pstoedit~ <2018-03-30 Fri>
Since Ghostscript 9.22, certain flags (e.g. ~dREALLYDEALYBIND~) are deprecated and ~pstoedit~,
a piece of software that Inkscape uses to render LaTeX, remains unchanged since 2005. This
makes Inkscape users unable use LaTeX. Textext developers claims that they will switch to
~pdf2svg~ frontend in their version 0.8 to avoid this trouble with ~pstoedit~. Meanwhile,
the only solution seems to be downgrade ghostscript to 9.21 each time one uses Inkscape.
In ArchLinux, one can downgrade a package using ~pacman~: 

#+BEGIN_SRC bash
ls /var/cache/pacman/pkg/ | grep ghostscript
pacman -U /var/cache/pacman/pkg/package-old_version.pkg.tar.xz
#+END_SRC

or a AUR package called ~downgrade~

#+BEGIN_SRC bash
downgrade ghostscript
#+END_SRC

I had good experience with both of them (~pacman~ to downgrade ~php~ to be compatible
with ~nextcloud~, and ~downgrade~ for ghostscript)


The problem is well documented [[https://bbs.archlinux.org/viewtopic.php?id=224340][here]] and [[https://bitbucket.org/pitgarbe/textext/issues/48/ghostscript-still-bug-under-linux][here]].

* LaTeX indentation in org-mode <2018-02-20 Tue>
  I was told, in accordance with my experience, that we visually process text better if
  each line in a paragraph is approximately below 80 characters. This fact is also
  omnipresent on the internet, standardized tests, books, etc.. being among the
  fundamentals of web design (except wikipedia, that's why I use Wikiwand).

  In Emacs, the key binding ~M-q~ will execute the ~fill-paragraph~ function that
  automatically shrinks text and insert "soft" newlines to shorten line below a certain
  threshold. This function however does not respect the LaTeX structure, e.g. it inserts
  line break inside inline equation and merge display equation.
  format paragraph.

#+BEGIN_SRC org
  This is a long long long long long long long long long paragraph with equation \( 1+1 = 
  2+0=3-1=4-2 \) with an equation in display \[ 1+ 1 = 2\].
#+END_SRC

The problem has been noticed around the Internet [[https://emacs.stackexchange.com/questions/29122/prevent-fill-paragraph-from-breaking-latex-displayed-equations-in-org-mode][here]] and [[https://emacs.stackexchange.com/questions/34938/is-there-a-fill-paragraph-function-which-tries-to-not-break-subordinate-parenthe?rq=1][there]].  

Meanwhile AucTeX does not have this annoying problem. [[https://www.gnu.org/software/auctex/manual/auctex.html#index-LaTeX_002dfill_002dbreak_002dat_002dseparators][It turns out]] that AUCTeX maps the
~M-q~ key to a different function, called ~LaTeX-fill-paragraph~. So the temporary fix is
to load ~latex.el~ in org-mode and maps ~M-q~ to ~LaTeX-fill-paragraph~

#+BEGIN_SRC org
(load "latex.el")
(global-set-key "\M-q" 'LaTeX-fill-paragraph)
#+END_SRC

* A (decent) map of mathematics <2017-10-17 Tue>

  I saw this [[https://www.flickr.com/photos/95869671@N08/32264483720][map of mathematics]] somewhere on YouTube and then again on the door of
  someone's office at the I2M. Although this map may help popularise mathematics, it
  should raise an eyebrow of a serious math student (or even an attentive highschool
  student, as for example 1 was listed among prime numbers in an earlier version of this
  map).

  For a decent map of Mathematics, made by a mathematician, see [[http://www.math.unm.edu/~buium/mapp.pdf][this]].

* My 2016-2017 internship <2017-07-31 Mon> 

I have just recently finished my Stage3A at [[https://www.i2m.univ-amu.fr/][Institut de Mathématiques de Marseille]]. It is
also in this period that I start this blog. The memoire can be founded here [[[../res/Stage2017.pdf][PDF]]]


#+LATEX:\iffalse
bibliographystyle:alpha
bibliography:../res/GeoDiff.bib
#+LATEX:\fi
