html/writings.html




<div id="outline-container-org3704448" class="outline-2">
<h2 id="org3704448"><span class="section-number-2">5</span> Commutative diagram revisited</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org7f2b65b" class="outline-3">
<h3 id="org7f2b65b"><span class="section-number-3">5.1</span> xypic and xyJax</h3>
<div class="outline-text-3" id="text-5-1">
<p>
To my knowledge, the only way to type commutative diagram on the web is to use <code>xyJax</code>, a
third-party extension of <code>MathJax</code> that render diagram using <code>xypic</code>. This is also how
<a href="https://stacks.math.columbia.edu/">Stacks Project</a> was set up.
</p>

<p>
The syntax of <code>xypic</code> is almost the same as <code>tikz-cd</code>, to a basic user the only difference
is how arrows are typed. I learn <code>xypic</code> syntax by rewriting a GUI editor for <code>tikzcd</code> by
<a href="https://tikzcd.yichuanshen.de">Yichuan Shen</a> to output <code>xypic</code> code. <a href="https://darknmt.github.io/res/xypic-editor/">Here</a> is the <code>xypic</code> version of the editor. I also
host a copy of the <code>tikz-cd</code> editor <a href="http://darknmt.github.io/res/tikzcd-editor">here</a>.
</p>

<p>
The configuration of <code>xyJax</code> or any third-party extension MathJax was not very easy for
 me, since it seems that MathJax CDN no longer hosts third-party extensions. So I have to
 host my own copy of <code>xyJax</code> and tell MathJax CDN to use it, as indicated in <a href="http://docs.mathjax.org/en/latest/options/ThirdParty.html">its
 documentation</a>. Also, one also has to <a href="https://github.com/sonoisa/XyJax/blob/master/README.md">reconfig a path</a> in <code>xyJax</code>.
</p>

<p>
To config MathJax in org-mode, apropos <code>org-html-mathjax-template</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf1b129f" class="outline-2">
<h2 id="orgf1b129f"><span class="section-number-2">6</span> LaTeX in Inkscape: Incompatibility between <code>ghostscript</code> and <code>pstoedit</code> <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-03-30 Fri&gt;</span></span></h2>
<div class="outline-text-2" id="text-6">
<p>
Since Ghostscript 9.22, certain flags (e.g. <code>dREALLYDEALYBIND</code>) are deprecated and <code>pstoedit</code>,
a piece of software that Inkscape uses to render LaTeX, remains unchanged since 2005. This
makes Inkscape users unable use LaTeX. Textext developers claims that they will switch to
<code>pdf2svg</code> frontend in their version 0.8 to avoid this trouble with <code>pstoedit</code>. Meanwhile,
the only solution seems to be downgrade ghostscript to 9.21 each time one uses Inkscape.
In ArchLinux, one can downgrade a package using <code>pacman</code>: 
</p>

<div class="org-src-container">
<pre class="src src-bash">ls /var/cache/pacman/pkg/ | grep ghostscript
pacman -U /var/cache/pacman/pkg/package-old_version.pkg.tar.xz
</pre>
</div>

<p>
or a AUR package called <code>downgrade</code>
</p>

<div class="org-src-container">
<pre class="src src-bash">downgrade ghostscript
</pre>
</div>

<p>
I had good experience with both of them (<code>pacman</code> to downgrade <code>php</code> to be compatible
with <code>nextcloud</code>, and <code>downgrade</code> for ghostscript)
</p>


<p>
The problem is well documented <a href="https://bbs.archlinux.org/viewtopic.php?id=224340">here</a> and <a href="https://bitbucket.org/pitgarbe/textext/issues/48/ghostscript-still-bug-under-linux">here</a>.
</p>
</div>
</div>

<div id="outline-container-org8752665" class="outline-2">
<h2 id="org8752665"><span class="section-number-2">7</span> LaTeX indentation in org-mode <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-02-20 Tue&gt;</span></span></h2>
<div class="outline-text-2" id="text-7">
<p>
I was told, in accordance with my experience, that we visually process text better if
each line in a paragraph is approximately below 80 characters. This fact is also
omnipresent on the internet, standardized tests, books, etc.. being among the
fundamentals of web design (except wikipedia, that's why I use Wikiwand).
</p>

<p>
In Emacs, the key binding <code>M-q</code> will execute the <code>fill-paragraph</code> function that
automatically shrinks text and insert "soft" newlines to shorten line below a certain
threshold. This function however does not respect the LaTeX structure, e.g. it inserts
line break inside inline equation and merge display equation.
format paragraph.
</p>

<div class="org-src-container">
<pre class="src src-org">This is a long long long long long long long long long paragraph with equation \( 1+1 = 
2+0=3-1=4-2 \) with an equation in display \[ 1+ 1 = 2\].
</pre>
</div>

<p>
The problem has been noticed around the Internet <a href="https://emacs.stackexchange.com/questions/29122/prevent-fill-paragraph-from-breaking-latex-displayed-equations-in-org-mode">here</a> and <a href="https://emacs.stackexchange.com/questions/34938/is-there-a-fill-paragraph-function-which-tries-to-not-break-subordinate-parenthe?rq=1">there</a>.  
</p>

<p>
Meanwhile AucTeX does not have this annoying problem. <a href="https://www.gnu.org/software/auctex/manual/auctex.html#index-LaTeX_002dfill_002dbreak_002dat_002dseparators">It turns out</a> that AUCTeX maps the
<code>M-q</code> key to a different function, called <code>LaTeX-fill-paragraph</code>. So the temporary fix is
to load <code>latex.el</code> in org-mode and maps <code>M-q</code> to <code>LaTeX-fill-paragraph</code>
</p>

<div class="org-src-container">
<pre class="src src-org">(load "latex.el")
(global-set-key "\M-q" 'LaTeX-fill-paragraph)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ba4fd2" class="outline-2">
<h2 id="org9ba4fd2"><span class="section-number-2">8</span> A (decent) map of mathematics <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-10-17 Tue&gt;</span></span></h2>
<div class="outline-text-2" id="text-8">
<p>
I saw this <a href="https://www.flickr.com/photos/95869671@N08/32264483720">map of mathematics</a> somewhere on YouTube and then again on the door of
someone's office at the I2M. Although this map may help popularise mathematics, it
should raise an eyebrow of a serious math student (or even an attentive highschool
student, as for example 1 was listed among prime numbers in an earlier version of this
map).
</p>

<p>
For a decent map of Mathematics, made by a mathematician, see <a href="http://www.math.unm.edu/~buium/mapp.pdf">this</a>.
</p>
</div>
</div>

<div id="outline-container-org5aa26c3" class="outline-2">
<h2 id="org5aa26c3"><span class="section-number-2">9</span> My 2016-2017 internship <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-07-31 Mon&gt;</span></span></h2>
<div class="outline-text-2" id="text-9">
<p>
I have just recently finished my Stage3A at <a href="https://www.i2m.univ-amu.fr/">Institut de Mathématiques de Marseille</a>. It is
also in this period that I start this blog. The memoire can be founded here [<a href="../res/Stage2017.pdf">PDF</a>]
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class='footer'>
By Tien.<br>
Last updated 2018-10-05 Fri 19:22. <br>
</div>
</div>
</body>
</html>
